Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: ཤེས་རབ་ཀྱི་དབང་པོ་ཡང་ཡིན་ལ། དབང་པོ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind of the spiritual faculty of wisdom, even though the nature of mind is that it has no faculties.

source: དབང་པོ་རྣམས་ཀྱང་ཡིན་ལ། ཆོས་ཐམས་ཅད་ལ་དབང་པོ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན། སྟོབས་རྣམས་ཀྱང་ཡིན་ལ།
en: It is a mind of the sense faculties, even though the nature of mind is that it does not have the faculty to sense all things.

source: མི་རྫི་བའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind of the powers, even though the nature of mind is out of range.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ཀྱང་ཡིན་ལ། བློས་རབ་ཏུ་འབྱེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind of the constitutive factors of awakening, even though the nature of mind is that it is fully manifested through awareness.

source: ལམ་སྒོམ་པ་ཉིད་ཀྱང་ཡིན་ལ། སྒོམ་པ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind of cultivating the path, even though the nature of mind is without cultivation.

source: ཞི་གནས་ཀྱང་ཡིན་ལ། སེམས་ཉེ་བར་ཞི་བ་ཉིད་ཀྱང་ཡིན།
en: It is a mind of calm abiding, even though the nature of mind is utterly tranquil.

source: ལྷག་མཐོང་ཡང་ཡིན་ལ། རྗེས་སུ་མི་མཐོང་བའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind of deep insight, even though the nature of mind is that it does not perceive anything.

source: འཕགས་པའི་བདེན་པ་སྒོམ་པ་ཡང་ཡིན་ལ། ཤིན་ཏུ་ཡོངས་སུ་ཤེས་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: “It is a mind of cultivating the truths of the noble ones, even though the nature of mind is that it is thoroughly and completely known.

source: སངས་རྒྱས་ཡིད་ལ་བྱེད་པ་ཡང་ཡིན་ལ། ཡིད་ལ་བྱེད་པ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind that focuses attention on the buddhas, even though the nature of mind is without any focused attention.

source: ཆོས་ཡིད་ལ་བྱེད་པ་ཡང་ཡིན་ལ། །ཆོས་ཀྱི་དབྱིངས་སུ་མཉམ་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind that focuses attention on the Dharma, even though the nature of mind is equal to the realm of reality.

source: དགེ་འདུན་ཡིད་ལ་བྱེད་པ་ཡང་ཡིན་ལ། མི་གནས་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind that focuses attention on the Saṅgha, even though the nature of mind is without a fixed abode.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་ཡང་བྱེད་ལ། གཟོད་མ་ནས་དག་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind that brings beings to maturity, even though the nature of mind is primordially pure.

source: དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ཡང་ཡིན་ལ། ཆོས་ཀྱི་དབྱིངས་དང་དབྱེར་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind that embraces the true Dharma, even though the nature of mind cannot be separated from the realm of reality.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཡང་ཡིན་ལ། སེམས་ནམ་མཁའ་དང་མཉམ་པ་ཉིད་ཀྱང་ཡིན།
en: It is a mind of purifying a buddha domain, even though mind has the nature of being equal to space.

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཡང་ཡིན་ལ། མི་དམིགས་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind that accepts the fact that things do not arise, even though the nature of mind cannot be conceived.

source: ཕྱིར་མི་ལྡོག་པའི་ས་ཡང་ཡིན་ལ། ལྡོག་པ་དང་འཇུག་པ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind at the stage of irreversibility, even though the nature of mind does not turn back or move forward.

source: མཚན་རབ་ཏུ་ཐོབ་པ་ཡང་ཡིན་ལ། མཚན་མ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind for attaining the marks of a great person, even though the nature of mind is without marks.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་རྒྱན་ཉིད་ཀྱང་ཡིན་ལ། ཁམས་གསུམ་གྱི་སྙིང་པོའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind that is adorned with the essence of awakening, even though the nature of mind is the essence of the three worlds.

source: བདུད་ཚར་གཅོད་པ་ཡང་ཡིན་ལ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་འདོགས་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind for defeating Māra in all his forms, even though the nature of mind is for benefitting all beings.

source: བྱང་ཆུབ་ཀྱང་ཡིན་ལ། ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པར་ཁོང་དུ་ཆུད་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind for awakening, even though the nature of mind is that it realizes that all things are insubstantial.

source: ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་ཡང་ཡིན་ལ། མི་འཇུག་མི་ལྡོག་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind for turning the wheel of Dharma, even though the nature of mind does not move forward or turn back.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཡང་སྟོན་ལ། འཁོར་བའི་རང་བཞིན་དང་མཉམ་པའི་སེམས་ཉིད་ཀྱང་ཡིན་ཏེ།
en: It is a mind that shows the great passing away into nirvāṇa, even though the nature of mind is the same as the essential nature of saṃsāra.

source: ཞི་བའི་བློ་གྲོས་འདི་ནི་བཟོད་པ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཀྱི་གསང་བ་དང་།
en: “Śāntamati, this is the secret of the mind of those bodhisattvas who have attained acceptance of the fact that things do not arise;

source: སེམས་ཀྱི་ལས་ཡོངས་སུ་དག་པའོ། །
en: this is the purity of their mental action.

source: སེམས་དག་པ་དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཡོངས་སུ་དག་པར་རྟོགས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་བྱང་ཆུབ་ཀྱི་སེམས་དེ་རྗེས་སུ་ཞུགས་པ་ཡིན་ནོ། །
en: With that pure mind, one realizes the minds of all beings to be pure, and one’s aspiration for awakening becomes fully absorbed in the minds of all beings.

source: བྱང་ཆུབ་ཀྱི་སེམས་དེ་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱང་སྣང་བར་གྱུར་པ་ཡིན་ནོ། །ཞི་བའི་བློ་གྲོས།
en: The minds of all beings are illuminated in the aspiration for awakening.

source: འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ནི་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་དང་། ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་པ་ཡིན་ནོ། །
en: Śāntamati, consider how space goes everywhere and surrounds everything.

source: ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ནི་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་དང་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་པ་ཡིན་ནོ། །
en: In the same way, Śāntamati, the bodhisattva’s mind goes everywhere and surrounds everything.”

source: གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དང་། ངག་དང་། སེམས་ཀྱི་གསང་བ་བསྟན་པ་འདི་བཤད་པ་ན། ལྷ་དང་མིའི་སྐྱེ་དགུའི་སྲོག་ཆགས་ལས་སྟོང་ཕྲག་བདུན་ཁྲི་ཉིས་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: When Vajrapāṇi, Lord of the Guhyakas, gave this teaching on the secrets of the body, speech, and mind of the bodhisattvas, seventy-two thousand beings from the divine and human realms conceived the aspiration for unsurpassable and perfect awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་སུམ་ཁྲི་ཉིས་སྟོང་གིས་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: Thirty-two thousand bodhisattvas attained acceptance of the fact that things do not arise.

source: སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ །
en: Eighty-four thousand beings purified the stainless and immaculate Dharma eye with respect to things.

source: དགེ་སློང་བརྒྱད་སྟོང་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: Eight thousand monks freed their minds from defilement with no further clinging.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏེ། སྟེང་གི་བར་སྣང་ལས་ཀྱང་མེ་ཏོག་གི་ཆར་མངོན་པར་བབ་བོ། །མ་བསྐྱོད་པར་སིལ་སྙན་དང་རོལ་མོའི་སྒྲ་སྟོང་སྙེད་རབ་ཏུ་གྲག་པར་གྱུར་ཏེ།
en: The cosmos of a billion worlds trembled in six ways and this universe was completely pervaded by a great light while flowers fell from the sky and the sound was heard of about a thousand cymbals and other musical instruments being played without anyone playing them.

source: སིལ་སྙན་དང་རོལ་མོའི་སྒྲ་དེ་དག་ལས་ཀྱང་གང་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བསྟན་པ་འདི་ཉན་པ་དང་། ཐོས་ནས་ཀྱང་འཛིན་ཅིང་མོས་པར་བྱེད་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་།
en: Along with the sound of the cymbals and other musical instruments, a voice was heard making statements like the following: “Those beings who have heard this teaching by Vajrapāṇi, Lord of the Guhyakas, will grasp it, trust in it, hold on to it, recite it, study it, and teach it in full to others;

source: གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པའི་སེམས་ཅན་དེ་དག་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ལ་རྨོངས་པ་མེད་པའི་བསམ་པ་དང་ལྡན་ཏེ། དགེ་བའི་རྩ་བ་ཆུང་ངུ་དང་ལྡན་བ་མ་ཡིན་ནོ། །
en: those beings will possess a clear motivation with respect to their aspiration for awakening and they will not fail to grow even the smallest roots of virtue;

source: དེ་དག་ནི་སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པར་རིག་པར་བྱ་སྟེ། དགེ་བའི་རྩ་བ་བསྐྱེད་པ། བསོད་ནམས་ཀྱི་ཚོགས་ཀྱིས་ཉེ་བར་བརྟན་པའོ། །
en: those beings will recognize that they have served many buddhas, grown the roots of virtue, and are supported by supplies of merit;

source: སེམས་ཅན་དེ་དག་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་ཐོགས་པར་གྱུར་པ་ཡིན་ཏེ་སེམས་ཅན་དེ་དག་ནི་ལུང་བསྟན་པའི་ས་ཐོབ་པར་འགྱུར་རོ་ཞེས་དེ་ལྟ་བུའི་སྒྲ་བྱུང་ངོ་། །
en: those beings will benefit all beings; and those beings will reach the stage at which they will receive predictions of their future awakening.”

source: བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་གསང་བའི་ལེའུ་ཞེས་བྱ་སྟེ་གསུམ་པའོ།། །།
en: This was the third chapter, “The Secret of the Bodhisattva’s Mind.” Chapter 4: The Coming of Resounding Musical Sound

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ལ་བཀའ་སྩལ་པ། ཞི་བའི་བློ་གྲོས། སིལ་སྙན་དང་། རོལ་མོའི་སྒྲ་ལས་འདི་ལྟ་བུའི་སྒྲ་བྱུང་བ་ཁྱོད་ཀྱིས་ཐོས་སམ། གསོལ་པ།
en: Then the Blessed One spoke to the bodhisattva of great courage, Śāntamati, saying, “Do you hear the voice issuing from the sounds of the cymbals and musical instruments?”

source: བཅོམ་ལྡན་འདས་ཐོས་ལགས་ཏེ་འདི་ལྟ་བུའི་སྒྲ་བྱུང་བ་དེ་སུའི་མཐུ་ལགས།
en: “Blessed One, I hear it! Whose power is causing the voice to issue from them?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “Śāntamati,” replied the Blessed One, “in the world called Meghavatī resides the blessed realized one Melodious King of Clouds.

source: ཞི་བའི་བློ་གྲོས་འདི་ནི་འཇིག་རྟེན་གྱི་ཁམས་སྤྲིན་ལྡན་ཞེས་བྱ་བ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་དབྱངས་རྒྱལ་པོ་ཞེས་བྱ་བའི་དྲུང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲ་དབྱངས་བསྒྲགས་པ་ཞེས་བྱ་བ་ང་ལ་བལྟ་བ་དང་།
en: In his presence resides the bodhisattva of great courage Resounding Musical Sound, who has now arrived here in this Sahā world to see me;

source: ཕྱག་བྱ་བ་དང་། མཆོད་པ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་།
en: to honor, worship, and serve me;

source: ཆོས་མཉན་པ་དང་།
en: and to hear the Dharma.

source: ལག་ན་རྡོ་རྗེས་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་མཉན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱོགས་བཅུ་ནས་འདུས་པ་འདི་དག་ལ་ཡང་བལྟ་བའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་འོངས་ཏེ།
en: He has also come to hear the Dharma that is being taught by Vajrapāṇi and to see the bodhisattvas of great courage who have gathered here from throughout the ten directions.

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲ་དབྱངས་བསྒྲགས་པ་ཞེས་བྱ་བ་དེ་ལུས་མི་སྣང་བར་སྟེང་གི་བར་སྣང་ལ་གནས་ནས་ང་དང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པའི་ཕྱིར་འདི་ལྟ་བུའི་མེ་ཏོག་གི་ཆར་མངོན་པར་འབེབས་ཤིང་སིལ་སྙན་དང་རོལ་མོའི་སྒྲ་ཡང་རབ་ཏུ་ཕྱུང་ནས་སིལ་སྙན་དང་རོལ་མོའི་སྒྲ་དེ་དག་ལས་སྒྲ་འདི་ལྟ་བུ་བྱུང་ངོ་། །
en: Although his body is invisible, Śāntamati, the bodhisattva Resounding Musical Sound is there in the space above us. In order to pay homage to me and this teaching of the Dharma, he has rained these flowers down upon us. He is playing the music of the cymbals and instruments and it is his voice that we are hearing.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུང་དེ་སྐད་བཀའ་སྩལ་ནས། རིང་པོ་མ་ལོན་པར་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲ་དབྱངས་བསྒྲགས་པ་ཞེས་བྱ་བ་བར་སྣང་དེ་ལས་བབས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་བརྒྱ་སྟོང་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ།
en: After the Blessed One had spoken, the bodhisattva named Resounding Musical Sound descended swiftly from the space above, bowed his head at the Blessed One’s feet, and proceeded to walk around him one hundred thousand times, keeping him on the right, before sitting down before the Blessed One.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་དབྱངས་རྒྱལ་པོས་བཅོམ་ལྡན་འདས་ལ་སྙུན་གསོལ་ཏེ།
en: He spoke thus to the Blessed One: “Blessed One, the realized one Melodious King of Clouds asks about your illness.

source: གནོད་པ་ཆུང་ངམ།
en: Are you not in too much pain?

source: ཉམ་ང་བ་ཉུང་ངམ།
en: Are you not in too much distress?

source: བསྐྱོད་པ་ཡང་ངམ།
en: Are you in good condition?

source: སྟོབས་དང་བདེ་བ་ལ་རེག་པར་གནས་སམ། ཞེས་སྙུན་གསོལ་ལོ། །
en: Are you strong, happy, and getting along comfortably?

source: ཡང་བཅོམ་ལྡན་འདས་དེ་འདི་སྐད་དུ། འདི་ལྟ་སྟེ་སངས་རྒྱས་ཀྱི་མཐུས། གསང་བ་པའི་བདག་པོས་བསྟན་པ་ཆེན་པོ་འདི་བསྟན་ཏོ་ཞེས་གསུང་ངོ་། །
en: Also, that blessed one said that the Lord of the Guhyakas is delivering this great teaching through the majestic power of the Buddha.

source: བཅོམ་ལྡན་འདས་འདི་འདྲ་བའི་སྤྱོད་པས་སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མ་མཆིས་པ་ཐོབ་པར་རྔོ་ཐོག་ལགས་སམ།
en: Blessed One, does one become capable of attaining the immeasurable qualities of a buddha through activities of this kind?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲ་དབྱངས་བསྒྲགས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ཁྱོད་ལེགས་པར་འོངས་སོ། །
en: Then the Blessed One said to the bodhisattva Resounding Musical Sound, “You are welcome, noble son.

source: ཁྱོད་འདིར་འོངས་པ་ལེགས་སོ། །
en: It is good that you have come here.

source: ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་གསང་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ་གསང་བ་པའི་བདག་པོ་ལས་ཐོས་པར་འགྱུར་རོ། །
en: You shall hear the chapter on the mysteries and secrets of the realized ones from the Lord of the Guhyakas.”

source: སྒྲ་དབྱངས་བསྒྲགས་པ་འོངས་པའི་ལེའུ་ཞེས་བྱ་སྟེ་བཞི་པའོ།། །།
en: This was the fourth chapter, “The Coming of Resounding Musical Sound.” Chapter 5: The Past-Life Story of Dhṛtarāṣṭra

source: དེ་ནས་འཁོར་དེ་ལས་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་འདི་སྙམ་དུ་སེམས་ཏེ། གསང་བ་པའི་བདག་པོ་འདིས་དགེ་བའི་རྩ་བ་གང་དུ་བསྐྱེད།
en: At that point, a certain bodhisattva from the assembly wondered, “How did the Lord of the Guhyakas grow these roots of virtue?

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་ལ་འདིས་བསྙེན་བཀུར་བྱས།
en: How long has he served the Blessed Buddha?

source: འདིས་སྨོན་ལམ་ཅི་འདྲ་བ་ཞིག་བཏབ་ན་གང་གི་ཕྱིར་འདི་འདྲ་བའི་སྤོབས་པ་དང་ལྡན་པར་གྱུར་སྙམ་མོ། །
en: What sort of vow did he make by means of which he has come to possess such inspired eloquence?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་སེམས་ཀྱི་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ལ་བཀའ་སྩལ་པ། ཞི་བའི་བློ་གྲོས་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ། རྒྱ་ཆེན་པོ་ཚད་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ། དཔག་ཏུ་མེད་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་བསྐལ་པ་མཛེས་པར་སྣང་བ་ཞེས་བྱ་བ་ལ་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བར།
en: With his own mind, the Blessed One knew the thoughts in the mind of that bodhisattva, and so he addressed the bodhisattva Śāntamati: “Once upon a time, Śāntamati, in a past eon, going back an incalculable eon, going back more than an incalculable eon, going back a limitless, inconceivable, and measureless span of time, there was an eon called Lovely Illumination.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡོན་ཏན་མཐའ་ཡས་རིན་ཆེན་སྣ་ཚོགས་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: At that time, in a world called Full Array, there appeared a realized one, a worthy one, a perfectly awakened one, one perfected in knowledge and conduct, a sublime one, a knower of the world, an unsurpassable trainer of those ready to be trained, a teacher of gods and humans, a blessed buddha, whose name was King Arrangement of Manifold Precious Virtues Without End.

source: ཞི་བའི་བློ་གྲོས་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་བརྒྱན་པ་དེ་ཡང་འབྱོར་པ། རྒྱས་པ། བདེ་བ། ལོ་ལེགས་པ།
en: “Śāntamati, Full Array was prosperous, well populated, and happy.

source: ཉམས་དགའ་བ།
en: There were abundant harvests and the people there were joyful.

source: ལྷ་དང་མི་མང་པོས་གང་བ། ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་པ། གསེག་མ་དང་གྱོ་མོ་མེད་པ།
en: It was full of gods and humans, flat like the palm of one’s hand, and it did not have any pebbles or stones.

source: རྩྭ་དག་དེར་སྐྱེས་པ་ཡང་འཇམ་པ་གོས་ཀ་ཙ་ལིན་དི་ཀ་ལྟར་རེག་ན་བདེ་བ། རྨ་བྱའི་མགྲིན་པ་ལྟར་སྔོ་ཞིང་གཡུང་དྲུང་འཁྱིལ་བར་གཡས་སུ་འཁྱིལ་པ།
en: The grass there was soft and pleasing to the touch like the finest silk, bluish green like a peacock’s neck, and it swirled to the right like a symbol of auspiciousness.

source: ཁ་དོག་དང་ལྡན་པ། དྲི་དང་ལྡན་པ། ཡིད་དུ་འོང་བ།
en: It possessed a beautiful hue and a pleasing fragrance, and it was quite appealing.

source: གོམ་པ་བོར་ན་སོར་བཞི་ཐུར་དུ་དམའ་བ། རྐང་པ་བཏེག་ན་སོར་བཞི་གྱེན་དུ་མཐོ་བ།
en: With every step, it would sink down four finger-widths and then spring back into place.

source: ཧ་ཅང་ཡང་མི་གྲང་། ཧ་ཅང་ཡང་མི་ཚ་བའི་རླུང་ཆུང་ངུ་བསིལ་བ།
en: There was a refreshing breeze in the air that was neither too hot nor too cold.

source: འདོད་པ་དང་འཐུན་པར་ལྡང་བའོ། །
en: It felt exactly as one would like.

source: ས་ཆེན་པོ་དེ་ཡང་བཻ་དཱུརྱ་སྔོན་པོས་བརྒྱན་པའོ། །
en: The earth was adorned with lapis lazuli.

source: སེམས་ཅན་དེ་རྣམས་ཀྱང་རྣམ་པ་བཟང་ཞིང་མཁས་པ་དང་ལྡན་པར་གྱུར་ཏེ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཆུང་བ།
en: The beings who lived there were well behaved, learned, and had little attachment, aversion, or ignorance.

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཆུང་བ།
en: In fact, the afflictions there were all minimal.

source: ལེགས་པར་བཤད་པའི་དོན་ཀུན་ཤེས་པར་བྱེད་ནུས་པའི་མཐུ་དང་ལྡན་པ་ཤ་སྟག་གོ །
en: Everyone had the capacity to understand the meaning of well-spoken words.

source: བཅོམ་ལྡན་འདས་ཡོན་ཏན་མཐའ་ཡས་རིན་ཆེན་སྣ་ཚོགས་བཀོད་པའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དེའི་ཉན་ཐོས་ཀྱི་དགེ་སློང་གི་དགེ་འདུན་ནི་ཁྲག་ཁྲིག་ཕྲག་བཅུ་གཉིས་ཡོད་དོ། །བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ནི་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་ཡོད་དོ། །
en: The community of monastic disciples of the Realized One, the blessed King Arrangement of Manifold Precious Virtues Without End, numbered one hundred twenty billion and his community of bodhisattvas numbered three hundred twenty million.

source: དེའི་སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་ཐུབ་བོ། །
en: His lifespan was three hundred sixty million years long.

source: མི་རྣམས་ཀྱང་དུས་མ་ཡིན་པར་བློ་བུར་དུ་འཆི་བ་མེད་དོ། །
en: In that realm no one died suddenly or at inopportune times.

source: ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་དེའི་དུས་ན་རྣམ་པར་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན། མཛེས་པར་སྣང་བ་ཞེས་བྱ་བ་གླིང་བཞི་པའི་འཇིག་རྟེན་བར་མ་རབ་ཏུ་འབྱོར་བ། རྒྱས་པ། བདེ་བ།
en: “At that time, Śāntamati, in Full Array there was a medium-sized world with four continents called Lovely Illumination.

source: རབ་ཏུ་ལོ་ལེགས་པ།
en: It was very prosperous, well populated, and happy.

source: ཡངས་ཤིང་ཐ་གྲུ་ཆེ་བ་བྱུང་སྟེ།
en: It had the most abundant harvests, and it was vast and spacious.

source: གླིང་བཞི་པ་རེ་རེ་ཡང་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་བརྒྱད་ཁྲི་བཞི་སྟོང་པར་གྱུར་ཏོ། །
en: Each of the four continents was eighty-four thousand square leagues.

source: དེར་གྲོང་ཁྱེར་ཆེན་པོ་ཡང་བར་བར་ན་དཔག་ཚད་གཅིག་ཡོད་པ། གྲོང་དང་། ཚོང་འདུས་དང་། རི་ཁྲོད་སྟོང་གིས་བསྐོར་བ་བྱུང་ངོ་། །
en: There was a league between each of the great cities, and each was surrounded by thousands of villages, towns, and market towns.

source: ཞི་བའི་བློ་གྲོས་གླིང་བཞི་པ་མཛེས་པར་སྣང་བ་དེའི་དབུས་ན་ཕོ་བྲང་གྲོང་ཁྱེར་རྣམ་པར་དག་པ་ཅན་ཞེས་བྱ་བ་ཡངས་ཤིང་རྒྱ་ཆེ་བ།
en: “Śāntamati, in the center of that four-continent world, Lovely Illumination, was the royal capital called Abode of Purity.

source: བྱང་དང་ལྷོར་ནི་དཔག་ཚད་དྲུག་ཅུ་རྩ་བཞི། ཤར་དང་ནུབ་ཏུ་ནི་དཔག་ཚད་བཞི་བཅུ་རྩ་གཉིས་ཡོད་པ།
en: Wide and expansive, its northern and southern sides were each sixty-four leagues long, and the eastern and western sides were each forty-two leagues long.

source: སྐྱེད་མོས་ཚལ་ཁྲིས་རབ་ཏུ་བརྒྱན་པ། གྲོང་དང་། ཚོང་འདུས་དང་། རི་ཁྲོད་ཁྲིས་ཀུན་ནས་བསྐོར་བ་ཡོད་དོ། །
en: It was adorned with thousands of parks, and surrounded by thousands of villages, towns, and market towns.

source: ཞི་བའི་བློ་གྲོས་རྒྱལ་པོའི་ཕོ་བྲང་རྣམ་པར་དག་པ་ཅན་ཞེས་བྱ་བ་དེར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་ཞེས་བྱ་བ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ། གླིང་བཞི་ལ་དབང་བ། སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ།
en: “Śāntamati, a wheel-turning king named Dhṛtarāṣṭra lived there in the royal palace of Abode of Purity.

source: དགེ་བའི་རྩ་བ་བསྐྱེད་པ། བསོད་ནམས་ཀྱི་གཟི་བརྗིད་ཀྱིས་གཟི་དང་ལྡན་པ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཞིག་བྱུང་ངོ་། །
en: He possessed the seven jewels, held sway over the four continents, had performed deeds in service to previous buddhas, had grown roots of virtue, possessed a radiance that shone with the splendor of merit, and had become impossible to turn back from unsurpassable and perfect awakening.

source: ཞི་བའི་བློ་གྲོས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གི་གྲོང་ཁྱེར་གྱི་དབུས་ན་ཁང་པ་རྒྱ་ཆེ་ཞིང་ཡངས་པ་ཆུ་ཞེང་དུ་དཔག་ཚད་བཅུ་དྲུག་ཡོད་པ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ར་བ་རིམ་བདུན་དང་། རྟ་བབས་དང་།
en: “Śāntamati, in the center of King Dhṛtarāṣṭra’s city was a vast and extensive palace the perimeter of which was sixteen leagues.

source: དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་རིམ་བདུན་གྱིས་ཀུན་ནས་བསྐོར་བ་བརྩིགས་སོ། །
en: It was surrounded by seven walls made of the seven precious substances, each with an archway and covered by netting with small bells.

source: ར་བའི་ནང་ན་སྐྱེད་མོས་ཚལ་ཆེན་པོ་བཞི་བྱས་ཏེ།
en: Inside the walls were four great parks.

source: འདི་ལྟ་སྟེ། མེ་ཏོག་སྣ་ཚོགས་ཞེས་བྱ་བའི་སྐྱེད་མོས་ཚལ་ཆེན་པོ་དང་།
en: The first great park was called Diverse Flowers;

source: ཡོན་ཏན་གྱིས་མངོན་པར་དགའ་བ་ཞེས་བྱ་བ་དང་།
en: the second, Delightful Virtues;

source: རྨ་བྱས་མངོན་པར་དགའ་བ་ཞེས་བྱ་བ་དང་།
en: the third, Delightful Peacocks;

source: དུས་ཀྱི་བདེ་བ་ཞེས་བྱ་བའོ། །
en: and the fourth, The Pleasure of Time.

source: རྫིང་ཁྱོན་དཔག་ཚད་ཕྱེད་པ་རིན་པོ་ཆེའི་ཁ་ཁྱེར་གྱིས་བསྐོར་བ་འཛམ་བུ་ཆུ་བོའི་གསེར་གྱི་གླེགས་མའི་འབབ་སྟེགས་ཅན། གསེར་གྱི་བྱེ་མ་བདལ་བ།
en: There were ponds a half-league in size with jeweled perimeters and the steps leading down to them were made of golden sand from the Jambu River.

source: ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་གང་བ།
en: Golden sand was also spread out beneath the ponds, which were filled with water that possessed the eight good qualities.

source: རིན་པོ་ཆེའི་པད་མས་ཀུན་ནས་ཁེབས་པ། ངང་བ་དང་། ཆུ་སྐྱར་དང་། བྱ་གག་དང་། ངུར་པ་དག་སྒྲ་འབྱིན་པ་བཞི་བྱས་ཏེ།
en: They were covered with jeweled lotuses, and the calls of swans, herons, ducks, and geese could be heard there.

source: འདི་ལྟ་སྟེ་དགའ་བ་ཞེས་བྱ་བ་དང་། དགའ་མཆོག་ཅེས་བྱ་བ་དང་། སྤོས་མཆོག་ཅེས་བྱ་བ་དང་། ཆུ་རྒྱུན་རྗེས་སུ་འབབ་པ་ཞེས་བྱ་བའོ། །
en: The names given to these ponds were Joy, Utmost Joy, Supreme Fragrance, and Descending Stream.

source: ཞི་བའི་བློ་གྲོས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གི་བཙུན་མོའི་འཁོར་བདུན་འབུམ་ཡོད་དེ་ཐམས་ཅད་ཀྱང་མཚན་དང་ལྡན་པའི་ན་ཆུང་བུད་མེད་རིན་པོ་ཆེའི་ལོངས་སྤྱོད་དང་འདྲ་བ་ཤ་སྟག་གོ །
en: “Śāntamati, the women of King Dhṛtarāṣṭra’s inner chambers numbered seven hundred thousand, all of whom had the marks of youthful femininity like precious gems.

source: དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་རབ་ཏུ་ཞུགས་པར་གྱུར་པ་དག་གོ །དེ་ལ་བུ་སྟོང་དུ་ཚང་བ་ཡོད་དེ།
en: Each and every one of them had become firmly established on the path to unsurpassable and perfect awakening.

source: དཔའ་བ། རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པ། སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཉི་ཤུ་རྩ་བརྒྱད་ཀྱིས་བརྒྱན་པ།
en: Present with them were their thousand sons, who were heroic, brave, had perfectly well-formed bodies, could defeat all their rivals, were adorned with twenty-eight of the marks of a great person, and had set their minds with a pure motivation on achieving unsurpassable and perfect awakening.

source: ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་པ་ཤ་སྟག་གོ །ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་ཡོན་ཏན་མཐའ་ཡས་རིན་ཆེན་སྣ་ཚོགས་བཀོད་པའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དེ་རྣམ་པར་དག་པ་དང་ལྡན་པའི་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་རྟེན་ཅིང་བཞུགས་ཏེ། རྒྱལ་པོ་དང་།
en: “At that time, Śāntamati, the blessed realized one, King Arrangement of Manifold Precious Virtues Without End, was dwelling near that royal capital.

source: རྒྱལ་པོའི་བློན་པོ་ཆེན་པོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དང་། གྲོང་རྡལ་བ་དང་། ཡུལ་འཁོར་གྱི་མིས་བསྟི་སྟང་བྱས། བླ་མར་བྱས། རི་མོར་བྱས། མཆོད་པ་བྱས་སོ། །
en: The king, his chief ministers, and the brahmins, householders, villagers, and farmers respected, revered, honored, and worshiped him.
